app/controllers/phone_numbers_controller.rb

UPDATE "phone_numbers" SET "number" = $1, "person_id" = $2, "updated_at" = $3 WHERE "phone_numbers"."id" = 3  [["number", "MyNewString"], ["person_id", 2], ["updated_at", "2014-12-09 08:18:42.235645"]]
---
  def update
    respond_to do |format|
      if @phone_number.update(phone_number_params)

DELETE FROM "phone_numbers" WHERE "phone_numbers"."id" = $1  [["id", 8]]
---
  def destroy
    @phone_number.destroy

SELECT  "phone_numbers".* FROM "phone_numbers"  WHERE "phone_numbers"."id" = $1 LIMIT 1  [["id", 8]]
---
    def set_phone_number
      @phone_number = PhoneNumber.find(params[:id])